In [1]:
import numpy as np
import pandas as pd

Dataset 1: Titanic-Like Passenger Dataset

In [3]:
np.random.seed(1)
rows = 200

df = pd.DataFrame({
    "PassengerId": np.arange(1, rows + 1),
    "Name": np.random.choice(["Mr. John", "Mrs. Anna", "Miss Emma", "Dr. Smith"], rows),
    "Age": np.random.choice(np.append(np.random.randint(1, 80, 180), [np.nan]*20), rows),
    "Sex": np.random.choice(["male", "female"], rows),
    "Pclass": np.random.choice([1, 2, 3], rows),
    "Fare": np.round(np.random.uniform(10, 500, rows), 2)
})

In [ ]:
#View Data
df.head()
df.tail()
df.sample(3)

     PassengerId       Name   Age     Sex  Pclass    Fare
128          129   Mr. John  18.0    male       3  338.25
175          176   Mr. John  33.0  female       3  329.26
41            42  Mrs. Anna  36.0    male       1   47.32

In [ ]:
#Inspect Structure
df.shape
df.columns
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  200 non-null    int64
 1   Name         200 non-null    object
 2   Age          182 non-null    float64
 3   Sex          200 non-null    object
 4   Pclass       200 non-null    int64
 5   Fare         200 non-null    float64
dtypes: float64(2), int64(2), object(2)
memory usage: 9.5+ KB

       PassengerId         Age      Pclass        Fare
count   200.000000  182.000000  200.000000  200.000000
mean    100.500000   43.318681    2.035000  251.249700
std      57.879185   22.078153    0.804369  146.847353
min       1.000000    1.000000    1.000000   11.250000
25%      50.750000   25.250000    1.000000  115.550000
50%     100.500000   41.000000    2.000000  265.430000
75%     150.250000   63.000000    3.000000  371.432500
max     200.000000   79.000000    3.000000  493.680000

In [ ]:
#Handle Missing Data
df.isnull().sum()
df["Age"].fillna(df["Age"].mean(), inplace=True)

C:\Users\likhi\AppData\Local\Temp\ipykernel_31836\1485509949.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(), inplace=True)

In [ ]:
#Filtering Rows
df[df["Age"] > 30]
df[df["Sex"] == "female"]

     PassengerId       Name        Age     Sex  Pclass    Fare
3              4   Mr. John  63.000000  female       2   92.36
4              5  Dr. Smith  39.000000  female       1  346.02
5              6  Mrs. Anna  26.000000  female       2  304.88
8              9  Dr. Smith  29.000000  female       3   44.05
10            11   Mr. John  77.000000  female       3  247.52
..           ...        ...        ...     ...     ...     ...
186          187   Mr. John  43.318681  female       1  148.20
190          191  Miss Emma  68.000000  female       1  367.68
191          192  Miss Emma  78.000000  female       3   12.94
193          194  Dr. Smith  43.318681  female       1   25.29
196          197  Dr. Smith  33.000000  female       1  300.03

[99 rows x 6 columns]

In [ ]:
#Grouping and Aggregation
df.groupby("Pclass")["Fare"].mean()

Pclass
1    237.222623
2    281.545775
3    232.200147
Name: Fare, dtype: float64

Dataset 2: Student Performance Dataset

In [11]:
np.random.seed(2)
rows = 150

df = pd.DataFrame({
    "StudentId": np.arange(1, rows + 1),
    "Age": np.random.randint(18, 30, rows),
    "Gender": np.random.choice(["male", "female"], rows),
    "Course": np.random.choice(["AI", "DS", "ML", "Python"], rows),
    "Marks": np.random.randint(35, 100, rows)
})

In [ ]:
#Sorting Data
df.sort_values(by="Marks", ascending=False)

     StudentId  Age  Gender  Course  Marks
140        141   26  female      DS     99
47          48   26  female      DS     99
30          31   26  female      ML     99
145        146   25  female      ML     99
19          20   22  female  Python     98
..         ...  ...     ...     ...    ...
110        111   29  female      ML     38
144        145   18  female  Python     37
40          41   28  female      ML     37
14          15   22  female      ML     35
11          12   23  female      ML     35

[150 rows x 5 columns]

In [ ]:
#Value Counts
df["Gender"].value_counts()

Gender
female    84
male      66
Name: count, dtype: int64

In [ ]:
#Apply Function
df["Result"] = df["Marks"].apply(lambda x: "Pass" if x >= 50 else "Fail")

In [ ]:
#Grouping
df.groupby("Course")["Marks"].mean()

Course
AI        68.185185
DS        64.611111
ML        62.125000
Python    68.282051
Name: Marks, dtype: float64

Dataset 3: Employee Dataset

In [ ]:
np.random.seed(3)
rows = 120

df = pd.DataFrame({
    "EmpId": np.arange(1, rows + 1),
    "Dept": np.random.choice(["HR", "IT", "Sales"], rows),
    "Salary": np.random.randint(30000, 150000, rows),
    "Gender": np.random.choice(["male", "female"], rows)
})

In [ ]:
#Rename and Drop
df.rename(columns={"Dept": "Department"}, inplace=True)
df.drop("Gender", axis=1, inplace=True)

In [ ]:
#Aggregation
df.groupby("Department")["Salary"].agg(["mean", "max"])

                    mean     max
Department
HR          85759.094340  149292
IT          92223.166667  145060
Sales       86745.483871  147177